<?php
//---------------1----------------
// $i = 0;
// while($i <= 100){
//     if($i % 3 == 0){
//         echo $i.",";
//     }
//     $i++;
// }

//---------------2----------------
// $i = 0;
// do{
//     if($i === 0){
//         echo $i." - Ноль <br>";
//     }
//     elseif($i % 2 == 0){
//         echo $i." - Четное число <br>";
//     }else{
//         echo $i." - Нечетное число <br>";
//     }
//     $i++;
// }
// while($i <= 10)

//---------------3----------------
// $arrayCity = [
//     "Московская область" => [
//         "Апрелевка","Балашиха","Бронницы","Верея","Видное","Волоколамск","Воскресенск","Высоковск","Голицыно","Городской округ","Черноголовка","Дедовск","Дзержинский","Дмитров","Долгопрудный","Домодедово","Дрезна","Дубна","Егорьевск","Железнодорожный","Жуковский","Зарайск","Звенигород","Ивантеевка","ИстраИстра-1","Кашира","Кашира-8","Климовск","Клин","Коломна","Королев","Котельники","Красногорск","Краснозаводск","Кубинка","Куровское","Ликино-Дулево","Лобня","Лосино-Петровский","Луховицы","Лыткарино","Люберцы","Можайск","Мытищи","Наро-Фоминск","Ногинск","Одинцово","Ожерелье","Озеры","Орехово-Зуево","Павловский Посад","Пересвет","Подольск","Протвино","Пушкино","Пущино","Раменское","Реутов","Рошаль","Руза","Сергиев Посад","Сергиев Посад-7","Серпухов","Снегири","Солнечногорск","Солнечногорск-2","Солнечногорск-25","Солнечногорск-30","Солнечногорск-7","Старая Купавна","Ступино","Талдом","Фрязино","Химки","Хотьково","Черноголовка","Чехов","Чехов-2","Чехов-3","Чехов-8","Шатура","Щелково","Электрогорск","Электросталь","Электроугли","Юбилейный","Яхрома"
//     ],
    
//     "Ленинградская область" => [
//         "Бокситогорск","Волосово","Волхов","Всеволожск","Выборг","Высоцк","Гатчина","Ивангород","Каменногорск","Кингисепп","Кириши","Кировск","Коммунар","Лодейное Поле","Луга","Любань","Никольское","Новая Ладога","Отрадное","Пикалево","Подпорожье","Приозерск","Светогорск","Сертолово","Сланцы","Сосновый Бор","Сясьстрой","Тихвин","Тосно","Шлиссельбург","Приморск"
//     ],

//     "Рязанская область" => [
//         "Касимов","Кораблино","Михайлов","Новомичуринск","Рыбное","Ряжск","Рязань","Сасово","Скопин","Спас-Клепики","Спасск-Рязанский","Шацк"
//     ]
// ];

// foreach ($arrayCity as $region => $city){   
//    echo "<h2>".$region.":</h2>";
//     foreach ($city as $key => $value){
//         $size = count($city);
//         if($key < $size - 1){
//             echo $value.", ";
//         }else{
//             echo $value;
//         } 
//     }   
// }

//---------------4----------------
// function translit($text){
//     $translit = [
//     "а"=>"a", "б"=>"b", "в"=>"v",
//     "г"=>"g", "д"=>"d", "е"=>"e",
//     "ё"=>"e", "ж"=>"zh", "з"=>"z",
//     "и"=>"i", "й"=>"i", "к"=>"k",
//     "л"=>"l", "м"=>"m", "н"=>"n",
//     "о"=>"o", "п"=>"p", "р"=>"r",
//     "с"=>"s", "т"=>"t", "у"=>"u",
//     "ф"=>"f", "х"=>"h", "ц"=>"c",
//     "ч"=>"ch", "ш"=>"sh", "щ"=>"shch",
//     "ы"=>"y", "э"=>"e", "ю"=>"yu",
//     "я"=>"ya", "ь"=>""
//     ];
//     return strtr(mb_strtolower($text), $translit);
// }
// echo translit ("Текст написанный транслитом");

//---------------5----------------
// function space($text){
//     $space = [" " => "_"];
//     return strtr($text, $space);
// }
// echo space("проверка пробелов много пробелов");

//---------------6----------------
// $menu = [
//     "MEN" => ["Accessories", "Bags", "Denim", "T-Shirts"],
//     "WOOMEN" => ["Accessories", "Jackets & Coats", "Polos", "T-Shirts", "Shirts"],
//     "KIDS" => ["Accessories", "Jackets & Coats", "Polos", "T-Shirts", "Shirts", "Bags"]
// ];

// foreach($menu as $cat => $podcat){
//     echo "<ul>".$cat;
//     foreach($podcat as $key => $value){
//         $size = count($podcat);
//         if($key != $size - 1){
//             echo "<li>".$value."</li>";
//         }else{
//             echo "<li>".$value."</li></ul>";
//         }
//     }
// }

//---------------7----------------
// for($i == 0; $i < 10; print($i++)){ }

//---------------8----------------
// function translit($text){
//     $translit = [
//         "а"=>"a", "б"=>"b", "в"=>"v",
//         "г"=>"g", "д"=>"d", "е"=>"e",
//         "ё"=>"e", "ж"=>"zh", "з"=>"z",
//         "и"=>"i", "й"=>"i", "к"=>"k",
//         "л"=>"l", "м"=>"m", "н"=>"n",
//         "о"=>"o", "п"=>"p", "р"=>"r",
//         "с"=>"s", "т"=>"t", "у"=>"u",
//         "ф"=>"f", "х"=>"h", "ц"=>"c",
//         "ч"=>"ch", "ш"=>"sh", "щ"=>"shch",
//         "ы"=>"y", "э"=>"e", "ю"=>"yu",
//         "я"=>"ya", "ь"=>"", " "=>"_"
//     ];
//     return strtr(mb_strtolower($text), $translit);
// }
// echo translit ("Текст написанный транслитом и с подчёркиванием вместо пробелов");
?>